[
  {
    "name": "Amal Al Kuwait",
    "description": "Enjoy 15% instant discount on all Amal Al Kuwait products when using your eligible NBK Card.Offer valid till 31 December 2025Aisha Alraqum PhysiotherapyGet 8% in NBK Rewards Points upon spending KD 40 or more at Aisha Alraqum Physiotherapy.BMWBuy a BMW car from Ali Alghanim & Sons Automotive and benefit from 0% interest on your Auto Loan.",
    "date": "2025-06-30",
    "category": "Shopping"
  },
  {
    "name": "Qatar Airways",
    "description": "Enjoy up to 12% discount on your tickets through Qatar Airways dedicated page using promo code QRKWNBK.Offer valid till 30 April 2026Luxurious Shopping Experience - PrivilegeYour shopping experience is leveled up at participating boutiques in selected VALUE RETAIL outlets.Offer valid till 31 December 2025Hajj Season Offer - VisaApply for a NBK SAR Prepaid Card this Hajj season and get the issuance fee waived.Offer valid till 18 June 2025Dubai Travel Offer - VisaYour Dubai trip gets better with up to 30% off dining, shopping, fashion and more when using your eligible NBK Visa Card.Offer valid till 30 June 2025Grand Hyatt Kuwait - PrivilegeGet special room rates and enjoy 15% discount at Stambul and Liberté restaurants.",
    "date": "2025-12-31",
    "category": "Travel"
  },
  {
    "name": "Petsmarket",
    "description": "Enjoy 10% instant discount when shopping through Petsmarket's website or app and using promo code NBK2025.SnigglesGet 10% in NBK Rewards Points upon spending KD 30 or more at Sniggles' store.deliveroo - PlusGet a KD 1.5 voucher to use on deliveroo when ordering coffee every Sunday with Plus Package.",
    "date": "2025-08-03",
    "category": "Shopping"
  },
  {
    "name": "Waha Lifestyle",
    "description": "Enjoy 15% instant discount when shopping from Waha Lifestyle's store, website or app and using promo code NBK15.DIGITS - Al ShababGet up to 30% discount on the latest selected tech devices and accessories at DIGITS store.Offer valid till 31 December 2025Cinescape - PlusBuy a ticket from Cinescape Cinemas and get the second ticket for free at selected locations.Offer valid till 31 December 2025Cinescape - PrivilegeGet a free ticket with \"Buy 1 Get 1 Free\" offer.Offer valid till 31 December 2025Umrah Special Offers - VisaGet up to 30% discount and many special offers at selected hotels when you book your Umrah trip.",
    "date": "2025-12-31",
    "category": "Shopping"
  },
  {
    "name": "Faces - Privilege",
    "description": "Enjoy 15% exclusive discount on all products at Faces stores.Offer valid till 31 December 2025Triple MGet 5% in NBK Rewards Points upon spending KD 250 or more at Triple M.Zain - PlusGet 10% cashback in NBK KWT Points when using NBK KWT Visa Infinite Credit Card at Zain.Offer valid till 31 December 2025Cinescape - Al ShababBuy a ticket from Cinescape Cinemas and get the second ticket for free every Wednesday at selected locations.Offer valid till 31 December 2025Grand Hyatt Kuwait - ThahabiGet special room rates and enjoy 15% discount at Stambul and Liberté restaurants.",
    "date": "2025-12-31",
    "category": "Shopping"
  },
  {
    "name": "Turkish Airlines",
    "description": "Enjoy 15% discount at Turkish Airlines office, website, or app by using the promocode NBK2025.",
    "date": "2025-12-31",
    "category": "Travel"
  },
  {
    "name": "Swaikhat & Tanoor",
    "description": "Enjoy 10% instant discount upon spending KD 10 or more at Swaikhat & Tanoor in the restaurant.Grand Hyatt KuwaitGet special room rates and 15% discount at Stambul and Liberte' restaurants in Grand Hyatt Kuwait.",
    "date": "2025-12-31",
    "category": "Dining"
  },
  {
    "name": "Harvey Nichols",
    "description": "Enjoy 10% discount from Harvey Nichols.",
    "date": "2025-07-31",
    "category": "Shopping"
  },
  {
    "name": "Spark Gym",
    "description": "Enjoy up to 25% discount on SPARK Athletic Center memberships.",
    "date": "2026-12-31",
    "category": "Fitness"
  },
  {
    "name": "NBK Al Watani",
    "description": "Get 10% cashback on all purchases made with NBK Al Watani credit card",
    "date": "2025-12-31",
    "category": "Banking"
  },
  {
    "name": "NBK Al Watani",
    "description": "Get 15% cashback on all purchases made with NBK Al Watani credit card",
    "date": "2025-12-31",
    "category": "Banking"
  },
  {
    "name": "NBK Al Watani",
    "description": "Get 20% cashback on all purchases made with NBK Al Watani credit card",
    "date": "2025-12-31",
    "category": "Banking"
  },
  {
    "name": "NBK Al Watani",
    "description": "Get 25% cashback on all purchases made with NBK Al Watani credit card",
    "date": "2025-12-31",
    "category": "Banking"
  },
  {
    "name": "NBK Al Watani",
    "description": "Get 30% cashback on all purchases made with NBK Al Watani credit card",
    "date": "2025-12-31",
    "category": "Banking"
  },
  {
    "name": "NBK Al Watani",
    "description": "Get 35% cashback on all purchases made with NBK Al Watani credit card",
    "date": "2025-12-31",
    "category": "Banking"
  },
  {
    "name": "NBK Al Watani",
    "description": "Get 40% cashback on all purchases made with NBK Al Watani credit card",
    "date": "2025-12-31",
    "category": "Banking"
  },
  {
    "name": "NBK Al Watani",
    "description": "Get 45% cashback on all purchases made with NBK Al Watani credit card",
    "date": "2025-12-31",
    "category": "Banking"
  },
  {
    "name": "NBK Al Watani",
    "description": "Get 50% cashback on all purchases made with NBK Al Watani credit card",
    "date": "2025-12-31",
    "category": "Banking"
  },
  {
    "name": "NBK Al Watani",
    "description": "Get 55% cashback on all purchases made with NBK Al Watani credit card",
    "date": "2025-12-31",
    "category": "Banking"
  },
  {
    "name": "NBK Al Watani",
    "description": "Get 60% cashback on all purchases made with NBK Al Watani credit card",
    "date": "2025-12-31",
    "category": "Banking"
  },
  {
    "name": "NBK Al Watani",
    "description": "Get 65% cashback on all purchases made with NBK Al Watani credit card",
    "date": "2025-12-31",
    "category": "Banking"
  },
  {
    "name": "NBK Al Watani",
    "description": "Get 70% cashback on all purchases made with NBK Al Watani credit card",
    "date": "2025-12-31",
    "category": "Banking"
  },
  {
    "name": "NBK Al Watani",
    "description": "Get 75% cashback on all purchases made with NBK Al Watani credit card",
    "date": "2025-12-31",
    "category": "Banking"
  },
  {
    "name": "NBK Al Watani",
    "description": "Get 80% cashback on all purchases made with NBK Al Watani credit card",
    "date": "2025-12-31",
    "category": "Banking"
  },
  {
    "name": "NBK Al Watani",
    "description": "Get 85% cashback on all purchases made with NBK Al Watani credit card",
    "date": "2025-12-31",
    "category": "Banking"
  },
  {
    "name": "NBK Al Watani",
    "description": "Get 90% cashback on all purchases made with NBK Al Watani credit card",
    "date": "2025-12-31",
    "category": "Banking"
  },
  {
    "name": "NBK Al Watani",
    "description": "Get 95% cashback on all purchases made with NBK Al Watani credit card",
    "date": "2025-12-31",
    "category": "Banking"
  },
  {
    "name": "NBK Al Watani",
    "description": "Get 100% cashback on all purchases made with NBK Al Watani credit card",
    "date": "2025-12-31",
    "category": "Banking"
  }
]
